#
name: "Inception_v2"
layer{
  name: "data"
  type: "HumanAttData"
  top: "data"
  top: "label_roi"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  human_att_data_param {
    source: "data/list/bmvc/rap_train.txt"
    root_folder: "data/rap/"
    batch_size: 160
    shuffle: true
    new_width: 256
    new_height: 256
    att_num: 51
    bbox_num: 100
  }
}
layer{
  name: "data"
  type: "HumanAttData"
  top: "data"
  top: "label_roi"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  human_att_data_param {
    source: "data/list/bmvc/rap_test.txt"
    root_folder: "data/rap/"
    batch_size: 32
    shuffle: false
    new_width: 256
    new_height: 256
    att_num: 51
    bbox_num: 100
  }
}
layer {
  name: "slice_label_roi"
  bottom: "label_roi"
  type: "Slice"
  top: "labels"
  top: "list_roi"
  slice_param {
    axis: 1
    slice_point: 51
  }
}
layer {
  name: "roi"
  bottom: "list_roi"
  top: "roi"
  type: "WsdRoigen"
  wsd_roigen_param {
    roi_num: 100
  }
}
layer {
  name: "labels_gather"
  bottom: "labels"
  top: "labels_gather"
  type: "Gather"
}
layer {
  name: "conv_conv1-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "data"
  top: "conv_conv1-cam"
  convolution_param { 
     num_output: 96
     kernel_size: 7
     stride: 2
     pad: 3
  }
}
layer {
  name: "bn_conv1-1-cam"
  type: "BNData"
  bottom: "conv_conv1-cam"
  top: "conv_conv1-a-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_conv1-cam"
  type: "ReLU"
  bottom: "conv_conv1-a-cam"
  top: "conv_conv1-a-cam"
}
layer {
  name: "pool1-cam"
  type: "Pooling"
  bottom: "conv_conv1-a-cam"
  top: "pool1-cam"
  pooling_param {
     pool: MAX
     kernel_size: 3
     stride: 2
     pad: 0
  }
}
layer {
  name: "conv_conv2red-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "pool1-cam"
  top: "conv_conv2red-cam"
  convolution_param { 
     num_output: 128
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bn_conv2red-1-cam"
  type: "BNData"
  bottom: "conv_conv2red-cam"
  top: "conv_conv2red-2-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }   
}
layer {
  name: "relu_conv2red-cam"
  type: "ReLU"
  bottom: "conv_conv2red-2-cam"
  top: "conv_conv2red-2-cam"
}
layer {
  name: "conv_conv2-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "conv_conv2red-2-cam"
  top: "conv_conv2-cam"
  convolution_param { 
     num_output: 288
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "bn_conv2-1-cam"
  type: "BNData"
  bottom: "conv_conv2-cam"
  top: "conv_conv2-2-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }  
}
layer {
  name: "relu_conv2-cam"
  type: "ReLU"
  bottom: "conv_conv2-2-cam"
  top: "conv_conv2-2-cam"
}
layer {
  name: "pool2-cam"
  type: "Pooling"
  bottom: "conv_conv2-2-cam"
  top: "pool2-cam"
  pooling_param {
     pool: MAX
     kernel_size: 3
     stride: 2
     pad: 0
  }
}
layer {
  name: "conv_3a_1x1-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "pool2-cam"
  top: "conv_3a_1x1-cam"
  convolution_param { 
     num_output: 96
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_3a_1x1-cam"
  type: "BNData"
  bottom: "conv_3a_1x1-cam"
  top: "conv_3a_1x1-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  } 
}
layer {
  name: "relu_3a_1x1-cam"
  type: "ReLU"
  bottom: "conv_3a_1x1-cam"
  top: "conv_3a_1x1-cam"
}
layer {
  name: "conv_3a_3x3_reduce-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "pool2-cam"
  top: "conv_3a_3x3_reduce-cam"
  convolution_param { 
     num_output: 96
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_3a_3x3_reduce-cam"
  type: "BNData"
  bottom: "conv_3a_3x3_reduce-cam"
  top: "conv_3a_3x3_reduce-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  } 
}
layer {
  name: "relu_3a_3x3_reduce-cam"
  type: "ReLU"
  bottom: "conv_3a_3x3_reduce-cam"
  top: "conv_3a_3x3_reduce-cam"
}
layer {
  name: "conv_3a_3x3-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "conv_3a_3x3_reduce-cam"
  top: "conv_3a_3x3-cam"
  convolution_param { 
     num_output: 96
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "bndata_3a_3x3-cam"
  type: "BNData"
  bottom: "conv_3a_3x3-cam"
  top: "conv_3a_3x3-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }  
}
layer {
  name: "relu_3a_3x3-cam"
  type: "ReLU"
  bottom: "conv_3a_3x3-cam"
  top: "conv_3a_3x3-cam"
}
layer {
  name: "conv_3a_double_3x3_reduce-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "pool2-cam"
  top: "conv_3a_double_3x3_reduce-cam"
  convolution_param { 
     num_output: 96
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_3a_double_3x3_reduce-cam"
  type: "BNData"
  bottom: "conv_3a_double_3x3_reduce-cam"
  top: "conv_3a_double_3x3_reduce-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_3a_double_3x3_reduce-cam"
  type: "ReLU"
  bottom: "conv_3a_double_3x3_reduce-cam"
  top: "conv_3a_double_3x3_reduce-cam"
}
layer {
  name: "conv_3a_double_3x3_0-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "conv_3a_double_3x3_reduce-cam"
  top: "conv_3a_double_3x3_0-cam"
  convolution_param { 
     num_output: 144
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "bndata_3a_double_3x3_0-cam"
  type: "BNData"
  bottom: "conv_3a_double_3x3_0-cam"
  top: "conv_3a_double_3x3_0-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_3a_double_3x3_0-cam"
  type: "ReLU"
  bottom: "conv_3a_double_3x3_0-cam"
  top: "conv_3a_double_3x3_0-cam"
}
layer {
  name: "conv_3a_double_3x3_1-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "conv_3a_double_3x3_0-cam"
  top: "conv_3a_double_3x3_1-cam"
  convolution_param { 
     num_output: 144
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "bndata_3a_double_3x3_1-cam"
  type: "BNData"
  bottom: "conv_3a_double_3x3_1-cam"
  top: "conv_3a_double_3x3_1-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_3a_double_3x3_1-cam"
  type: "ReLU"
  bottom: "conv_3a_double_3x3_1-cam"
  top: "conv_3a_double_3x3_1-cam"
}
layer {
  name: "ave_pool_3a_pool-cam"
  type: "Pooling"
  bottom: "pool2-cam"
  top: "ave_pool_3a_pool-cam"
  pooling_param {
     pool: AVE
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "conv_3a_proj-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ave_pool_3a_pool-cam"
  top: "conv_3a_proj-cam"
  convolution_param { 
     num_output: 48
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_3a_proj-cam"
  type: "BNData"
  bottom: "conv_3a_proj-cam"
  top: "conv_3a_proj-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_3a_proj-cam"
  type: "ReLU"
  bottom: "conv_3a_proj-cam"
  top: "conv_3a_proj-cam"
}
layer {
  name: "ch_concat_3a_chconcat-cam"
  type: "Concat"
  bottom: "conv_3a_1x1-cam"
  bottom: "conv_3a_3x3-cam"
  bottom: "conv_3a_double_3x3_1-cam"
  bottom: "conv_3a_proj-cam"
  top: "ch_concat_3a_chconcat-cam"
}
layer {
  name: "conv_3b_1x1-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ch_concat_3a_chconcat-cam"
  top: "conv_3b_1x1-cam"
  convolution_param { 
     num_output: 96
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_3b_1x1-cam"
  type: "BNData"
  bottom: "conv_3b_1x1-cam"
  top: "conv_3b_1x1-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_3b_1x1-cam"
  type: "ReLU"
  bottom: "conv_3b_1x1-cam"
  top: "conv_3b_1x1-cam"
}
layer {
  name: "conv_3b_3x3_reduce-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ch_concat_3a_chconcat-cam"
  top: "conv_3b_3x3_reduce-cam"
  convolution_param { 
     num_output: 96
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_3b_3x3_reduce-cam"
  type: "BNData"
  bottom: "conv_3b_3x3_reduce-cam"
  top: "conv_3b_3x3_reduce-cam"
 param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  } 
}
layer {
  name: "relu_3b_3x3_reduce-cam"
  type: "ReLU"
  bottom: "conv_3b_3x3_reduce-cam"
  top: "conv_3b_3x3_reduce-cam"
}
layer {
  name: "conv_3b_3x3-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "conv_3b_3x3_reduce-cam"
  top: "conv_3b_3x3-cam"
  convolution_param { 
     num_output: 144
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "bndata_3b_3x3-cam"
  type: "BNData"
  bottom: "conv_3b_3x3-cam"
  top: "conv_3b_3x3-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_3b_3x3-cam"
  type: "ReLU"
  bottom: "conv_3b_3x3-cam"
  top: "conv_3b_3x3-cam"
}
layer {
  name: "conv_3b_double_3x3_reduce-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ch_concat_3a_chconcat-cam"
  top: "conv_3b_double_3x3_reduce-cam"
  convolution_param { 
     num_output: 96
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_3b_double_3x3_reduce-cam"
  type: "BNData"
  bottom: "conv_3b_double_3x3_reduce-cam"
  top: "conv_3b_double_3x3_reduce-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_3b_double_3x3_reduce-cam"
  type: "ReLU"
  bottom: "conv_3b_double_3x3_reduce-cam"
  top: "conv_3b_double_3x3_reduce-cam"
}
layer {
  name: "conv_3b_double_3x3_0-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "conv_3b_double_3x3_reduce-cam"
  top: "conv_3b_double_3x3_0-cam"
  convolution_param { 
     num_output: 144
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "bndata_3b_double_3x3_0-cam"
  type: "BNData"
  bottom: "conv_3b_double_3x3_0-cam"
  top: "conv_3b_double_3x3_0-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_3b_double_3x3_0-cam"
  type: "ReLU"
  bottom: "conv_3b_double_3x3_0-cam"
  top: "conv_3b_double_3x3_0-cam"
}
layer {
  name: "conv_3b_double_3x3_1-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "conv_3b_double_3x3_0-cam"
  top: "conv_3b_double_3x3_1-cam"
  convolution_param { 
     num_output: 144
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "bndata_3b_double_3x3_1-cam"
  type: "BNData"
  bottom: "conv_3b_double_3x3_1-cam"
  top: "conv_3b_double_3x3_1-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_3b_double_3x3_1-cam"
  type: "ReLU"
  bottom: "conv_3b_double_3x3_1-cam"
  top: "conv_3b_double_3x3_1-cam"
}
layer {
  name: "ave_pool_3b_pool-cam"
  type: "Pooling"
  bottom: "ch_concat_3a_chconcat-cam"
  top: "ave_pool_3b_pool-cam"
  pooling_param {
     pool: AVE
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "conv_3b_proj-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ave_pool_3b_pool-cam"
  top: "conv_3b_proj-cam"
  convolution_param { 
     num_output: 96
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_3b_proj-cam"
  type: "BNData"
  bottom: "conv_3b_proj-cam"
  top: "conv_3b_proj-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_3b_proj-cam"
  type: "ReLU"
  bottom: "conv_3b_proj-cam"
  top: "conv_3b_proj-cam"
}
layer {
  name: "ch_concat_3b_chconcat-cam"
  type: "Concat"
  bottom: "conv_3b_1x1-cam"
  bottom: "conv_3b_3x3-cam"
  bottom: "conv_3b_double_3x3_1-cam"
  bottom: "conv_3b_proj-cam"
  top: "ch_concat_3b_chconcat-cam"
}
layer {
  name: "conv_3c_3x3_reduce-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ch_concat_3b_chconcat-cam"
  top: "conv_3c_3x3_reduce-cam"
  convolution_param { 
     num_output: 192
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_3c_3x3_reduce-cam"
  type: "BNData"
  bottom: "conv_3c_3x3_reduce-cam"
  top: "conv_3c_3x3_reduce-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_3c_3x3_reduce-cam"
  type: "ReLU"
  bottom: "conv_3c_3x3_reduce-cam"
  top: "conv_3c_3x3_reduce-cam"
}
layer {
  name: "conv_3c_3x3-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "conv_3c_3x3_reduce-cam"
  top: "conv_3c_3x3-cam"
  convolution_param { 
     num_output: 240
     kernel_size: 3
     stride: 2
     pad: 1
  }
}
layer {
  name: "bndata_3c_3x3-cam"
  type: "BNData"
  bottom: "conv_3c_3x3-cam"
  top: "conv_3c_3x3-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_3c_3x3-cam"
  type: "ReLU"
  bottom: "conv_3c_3x3-cam"
  top: "conv_3c_3x3-cam"
}
layer {
  name: "conv_3c_double_3x3_reduce-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ch_concat_3b_chconcat-cam"
  top: "conv_3c_double_3x3_reduce-cam"
  convolution_param { 
     num_output: 96
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_3c_double_3x3_reduce-cam"
  type: "BNData"
  bottom: "conv_3c_double_3x3_reduce-cam"
  top: "conv_3c_double_3x3_reduce-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_3c_double_3x3_reduce-cam"
  type: "ReLU"
  bottom: "conv_3c_double_3x3_reduce-cam"
  top: "conv_3c_double_3x3_reduce-cam"
}
layer {
  name: "conv_3c_double_3x3_0-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "conv_3c_double_3x3_reduce-cam"
  top: "conv_3c_double_3x3_0-cam"
  convolution_param { 
     num_output: 144
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "bndata_3c_double_3x3_0-cam"
  type: "BNData"
  bottom: "conv_3c_double_3x3_0-cam"
  top: "conv_3c_double_3x3_0-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_3c_double_3x3_0-cam"
  type: "ReLU"
  bottom: "conv_3c_double_3x3_0-cam"
  top: "conv_3c_double_3x3_0-cam"
}
layer {
  name: "conv_3c_double_3x3_1-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "conv_3c_double_3x3_0-cam"
  top: "conv_3c_double_3x3_1-cam"
  convolution_param { 
     num_output: 144
     kernel_size: 3
     stride: 2
     pad: 1
  }
}
layer {
  name: "bndata_3c_double_3x3_1-cam"
  type: "BNData"
  bottom: "conv_3c_double_3x3_1-cam"
  top: "conv_3c_double_3x3_1-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_3c_double_3x3_1-cam"
  type: "ReLU"
  bottom: "conv_3c_double_3x3_1-cam"
  top: "conv_3c_double_3x3_1-cam"
}
layer {
  name: "max_pool_3c_pool-cam"
  type: "Pooling"
  bottom: "ch_concat_3b_chconcat-cam"
  top: "max_pool_3c_pool-cam"
  pooling_param {
     pool: MAX
     kernel_size: 3
     stride: 2
     pad: 0
  }
}
layer {
  name: "ch_concat_3c_chconcat-cam"
  type: "Concat"
  bottom: "conv_3c_3x3-cam"
  bottom: "conv_3c_double_3x3_1-cam"
  bottom: "max_pool_3c_pool-cam"
  top: "ch_concat_3c_chconcat-cam"
}
layer {
  name: "conv_4a_1x1-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ch_concat_3c_chconcat-cam"
  top: "conv_4a_1x1-cam"
  convolution_param { 
     num_output: 224
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_4a_1x1-cam"
  type: "BNData"
  bottom: "conv_4a_1x1-cam"
  top: "conv_4a_1x1-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4a_1x1-cam"
  type: "ReLU"
  bottom: "conv_4a_1x1-cam"
  top: "conv_4a_1x1-cam"
}
layer {
  name: "conv_4a_3x3_reduce-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ch_concat_3c_chconcat-cam"
  top: "conv_4a_3x3_reduce-cam"
  convolution_param { 
     num_output: 64
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_4a_3x3_reduce-cam"
  type: "BNData"
  bottom: "conv_4a_3x3_reduce-cam"
  top: "conv_4a_3x3_reduce-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4a_3x3_reduce-cam"
  type: "ReLU"
  bottom: "conv_4a_3x3_reduce-cam"
  top: "conv_4a_3x3_reduce-cam"
}
layer {
  name: "conv_4a_3x3-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "conv_4a_3x3_reduce-cam"
  top: "conv_4a_3x3-cam"
  convolution_param { 
     num_output: 96
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "bndata_4a_3x3-cam"
  type: "BNData"
  bottom: "conv_4a_3x3-cam"
  top: "conv_4a_3x3-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4a_3x3-cam"
  type: "ReLU"
  bottom: "conv_4a_3x3-cam"
  top: "conv_4a_3x3-cam"
}
layer {
  name: "conv_4a_double_3x3_reduce-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ch_concat_3c_chconcat-cam"
  top: "conv_4a_double_3x3_reduce-cam"
  convolution_param { 
     num_output: 96
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_4a_double_3x3_reduce-cam"
  type: "BNData"
  bottom: "conv_4a_double_3x3_reduce-cam"
  top: "conv_4a_double_3x3_reduce-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4a_double_3x3_reduce-cam"
  type: "ReLU"
  bottom: "conv_4a_double_3x3_reduce-cam"
  top: "conv_4a_double_3x3_reduce-cam"
}
layer {
  name: "conv_4a_double_3x3_0-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "conv_4a_double_3x3_reduce-cam"
  top: "conv_4a_double_3x3_0-cam"
  convolution_param { 
     num_output: 128
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "bndata_4a_double_3x3_0-cam"
  type: "BNData"
  bottom: "conv_4a_double_3x3_0-cam"
  top: "conv_4a_double_3x3_0-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4a_double_3x3_0-cam"
  type: "ReLU"
  bottom: "conv_4a_double_3x3_0-cam"
  top: "conv_4a_double_3x3_0-cam"
}
layer {
  name: "conv_4a_double_3x3_1-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "conv_4a_double_3x3_0-cam"
  top: "conv_4a_double_3x3_1-cam"
  convolution_param { 
     num_output: 128
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "bndata_4a_double_3x3_1-cam"
  type: "BNData"
  bottom: "conv_4a_double_3x3_1-cam"
  top: "conv_4a_double_3x3_1-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4a_double_3x3_1-cam"
  type: "ReLU"
  bottom: "conv_4a_double_3x3_1-cam"
  top: "conv_4a_double_3x3_1-cam"
}
layer {
  name: "ave_pool_4a_pool-cam"
  type: "Pooling"
  bottom: "ch_concat_3c_chconcat-cam"
  top: "ave_pool_4a_pool-cam"
  pooling_param {
     pool: AVE
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "conv_4a_proj-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ave_pool_4a_pool-cam"
  top: "conv_4a_proj-cam"
  convolution_param { 
     num_output: 128
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_4a_proj-cam"
  type: "BNData"
  bottom: "conv_4a_proj-cam"
  top: "conv_4a_proj-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4a_proj-cam"
  type: "ReLU"
  bottom: "conv_4a_proj-cam"
  top: "conv_4a_proj-cam"
}
layer {
  name: "ch_concat_4a_chconcat-cam"
  type: "Concat"
  bottom: "conv_4a_1x1-cam"
  bottom: "conv_4a_3x3-cam"
  bottom: "conv_4a_double_3x3_1-cam"
  bottom: "conv_4a_proj-cam"
  top: "ch_concat_4a_chconcat-cam"
}
layer {
  name: "conv_4b_1x1-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ch_concat_4a_chconcat-cam"
  top: "conv_4b_1x1-cam"
  convolution_param { 
     num_output: 192
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_4b_1x1-cam"
  type: "BNData"
  bottom: "conv_4b_1x1-cam"
  top: "conv_4b_1x1-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4b_1x1-cam"
  type: "ReLU"
  bottom: "conv_4b_1x1-cam"
  top: "conv_4b_1x1-cam"
}
layer {
  name: "conv_4b_3x3_reduce-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ch_concat_4a_chconcat-cam"
  top: "conv_4b_3x3_reduce-cam"
  convolution_param { 
     num_output: 96
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_4b_3x3_reduce-cam"
  type: "BNData"
  bottom: "conv_4b_3x3_reduce-cam"
  top: "conv_4b_3x3_reduce-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4b_3x3_reduce-cam"
  type: "ReLU"
  bottom: "conv_4b_3x3_reduce-cam"
  top: "conv_4b_3x3_reduce-cam"
}
layer {
  name: "conv_4b_3x3-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "conv_4b_3x3_reduce-cam"
  top: "conv_4b_3x3-cam"
  convolution_param { 
     num_output: 128
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "bndata_4b_3x3-cam"
  type: "BNData"
  bottom: "conv_4b_3x3-cam"
  top: "conv_4b_3x3-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4b_3x3-cam"
  type: "ReLU"
  bottom: "conv_4b_3x3-cam"
  top: "conv_4b_3x3-cam"
}
layer {
  name: "conv_4b_double_3x3_reduce-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ch_concat_4a_chconcat-cam"
  top: "conv_4b_double_3x3_reduce-cam"
  convolution_param { 
     num_output: 96
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_4b_double_3x3_reduce-cam"
  type: "BNData"
  bottom: "conv_4b_double_3x3_reduce-cam"
  top: "conv_4b_double_3x3_reduce-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4b_double_3x3_reduce-cam"
  type: "ReLU"
  bottom: "conv_4b_double_3x3_reduce-cam"
  top: "conv_4b_double_3x3_reduce-cam"
}
layer {
  name: "conv_4b_double_3x3_0-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "conv_4b_double_3x3_reduce-cam"
  top: "conv_4b_double_3x3_0-cam"
  convolution_param { 
     num_output: 128
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "bndata_4b_double_3x3_0-cam"
  type: "BNData"
  bottom: "conv_4b_double_3x3_0-cam"
  top: "conv_4b_double_3x3_0-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4b_double_3x3_0-cam"
  type: "ReLU"
  bottom: "conv_4b_double_3x3_0-cam"
  top: "conv_4b_double_3x3_0-cam"
}
layer {
  name: "conv_4b_double_3x3_1-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "conv_4b_double_3x3_0-cam"
  top: "conv_4b_double_3x3_1-cam"
  convolution_param { 
     num_output: 128
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "bndata_4b_double_3x3_1-cam"
  type: "BNData"
  bottom: "conv_4b_double_3x3_1-cam"
  top: "conv_4b_double_3x3_1-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4b_double_3x3_1-cam"
  type: "ReLU"
  bottom: "conv_4b_double_3x3_1-cam"
  top: "conv_4b_double_3x3_1-cam"
}
layer {
  name: "ave_pool_4b_pool-cam"
  type: "Pooling"
  bottom: "ch_concat_4a_chconcat-cam"
  top: "ave_pool_4b_pool-cam"
  pooling_param {
     pool: AVE
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "conv_4b_proj-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ave_pool_4b_pool-cam"
  top: "conv_4b_proj-cam"
  convolution_param { 
     num_output: 128
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_4b_proj-cam"
  type: "BNData"
  bottom: "conv_4b_proj-cam"
  top: "conv_4b_proj-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4b_proj-cam"
  type: "ReLU"
  bottom: "conv_4b_proj-cam"
  top: "conv_4b_proj-cam"
}
layer {
  name: "ch_concat_4b_chconcat-cam"
  type: "Concat"
  bottom: "conv_4b_1x1-cam"
  bottom: "conv_4b_3x3-cam"
  bottom: "conv_4b_double_3x3_1-cam"
  bottom: "conv_4b_proj-cam"
  top: "ch_concat_4b_chconcat-cam"
}
layer {
  name: "conv_4c_1x1-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ch_concat_4b_chconcat-cam"
  top: "conv_4c_1x1-cam"
  convolution_param { 
     num_output: 160
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_4c_1x1-cam"
  type: "BNData"
  bottom: "conv_4c_1x1-cam"
  top: "conv_4c_1x1-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4c_1x1-cam"
  type: "ReLU"
  bottom: "conv_4c_1x1-cam"
  top: "conv_4c_1x1-cam"
}
layer {
  name: "conv_4c_3x3_reduce-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ch_concat_4b_chconcat-cam"
  top: "conv_4c_3x3_reduce-cam"
  convolution_param { 
     num_output: 128
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_4c_3x3_reduce-cam"
  type: "BNData"
  bottom: "conv_4c_3x3_reduce-cam"
  top: "conv_4c_3x3_reduce-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4c_3x3_reduce-cam"
  type: "ReLU"
  bottom: "conv_4c_3x3_reduce-cam"
  top: "conv_4c_3x3_reduce-cam"
}
layer {
  name: "conv_4c_3x3-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "conv_4c_3x3_reduce-cam"
  top: "conv_4c_3x3-cam"
  convolution_param { 
     num_output: 160
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "bndata_4c_3x3-cam"
  type: "BNData"
  bottom: "conv_4c_3x3-cam"
  top: "conv_4c_3x3-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4c_3x3-cam"
  type: "ReLU"
  bottom: "conv_4c_3x3-cam"
  top: "conv_4c_3x3-cam"
}
layer {
  name: "conv_4c_double_3x3_reduce-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ch_concat_4b_chconcat-cam"
  top: "conv_4c_double_3x3_reduce-cam"
  convolution_param { 
     num_output: 128
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_4c_double_3x3_reduce-cam"
  type: "BNData"
  bottom: "conv_4c_double_3x3_reduce-cam"
  top: "conv_4c_double_3x3_reduce-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4c_double_3x3_reduce-cam"
  type: "ReLU"
  bottom: "conv_4c_double_3x3_reduce-cam"
  top: "conv_4c_double_3x3_reduce-cam"
}
layer {
  name: "conv_4c_double_3x3_0-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "conv_4c_double_3x3_reduce-cam"
  top: "conv_4c_double_3x3_0-cam"
  convolution_param { 
     num_output: 160
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "bndata_4c_double_3x3_0-cam"
  type: "BNData"
  bottom: "conv_4c_double_3x3_0-cam"
  top: "conv_4c_double_3x3_0-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4c_double_3x3_0-cam"
  type: "ReLU"
  bottom: "conv_4c_double_3x3_0-cam"
  top: "conv_4c_double_3x3_0-cam"
}
layer {
  name: "conv_4c_double_3x3_1-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "conv_4c_double_3x3_0-cam"
  top: "conv_4c_double_3x3_1-cam"
  convolution_param { 
     num_output: 160
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "bndata_4c_double_3x3_1-cam"
  type: "BNData"
  bottom: "conv_4c_double_3x3_1-cam"
  top: "conv_4c_double_3x3_1-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4c_double_3x3_1-cam"
  type: "ReLU"
  bottom: "conv_4c_double_3x3_1-cam"
  top: "conv_4c_double_3x3_1-cam"
}
layer {
  name: "ave_pool_4c_pool-cam"
  type: "Pooling"
  bottom: "ch_concat_4b_chconcat-cam"
  top: "ave_pool_4c_pool-cam"
  pooling_param {
     pool: AVE
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "conv_4c_proj-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ave_pool_4c_pool-cam"
  top: "conv_4c_proj-cam"
  convolution_param { 
     num_output: 128
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_4c_proj-cam"
  type: "BNData"
  bottom: "conv_4c_proj-cam"
  top: "conv_4c_proj-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4c_proj-cam"
  type: "ReLU"
  bottom: "conv_4c_proj-cam"
  top: "conv_4c_proj-cam"
}
layer {
  name: "ch_concat_4c_chconcat-cam"
  type: "Concat"
  bottom: "conv_4c_1x1-cam"
  bottom: "conv_4c_3x3-cam"
  bottom: "conv_4c_double_3x3_1-cam"
  bottom: "conv_4c_proj-cam"
  top: "ch_concat_4c_chconcat-cam"
}
layer {
  name: "conv_4d_1x1-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ch_concat_4c_chconcat-cam"
  top: "conv_4d_1x1-cam"
  convolution_param { 
     num_output: 96
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_4d_1x1-cam"
  type: "BNData"
  bottom: "conv_4d_1x1-cam"
  top: "conv_4d_1x1-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4d_1x1-cam"
  type: "ReLU"
  bottom: "conv_4d_1x1-cam"
  top: "conv_4d_1x1-cam"
}
layer {
  name: "conv_4d_3x3_reduce-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ch_concat_4c_chconcat-cam"
  top: "conv_4d_3x3_reduce-cam"
  convolution_param { 
     num_output: 128
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_4d_3x3_reduce-cam"
  type: "BNData"
  bottom: "conv_4d_3x3_reduce-cam"
  top: "conv_4d_3x3_reduce-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4d_3x3_reduce-cam"
  type: "ReLU"
  bottom: "conv_4d_3x3_reduce-cam"
  top: "conv_4d_3x3_reduce-cam"
}
layer {
  name: "conv_4d_3x3-cam"
  type: "ConvolutionData"
  bottom: "conv_4d_3x3_reduce-cam"
  top: "conv_4d_3x3-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param { 
     num_output: 192
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "bndata_4d_3x3-cam"
  type: "BNData"
  bottom: "conv_4d_3x3-cam"
  top: "conv_4d_3x3-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4d_3x3-cam"
  type: "ReLU"
  bottom: "conv_4d_3x3-cam"
  top: "conv_4d_3x3-cam"
}
layer {
  name: "conv_4d_double_3x3_reduce-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "ch_concat_4c_chconcat-cam"
  top: "conv_4d_double_3x3_reduce-cam"
  convolution_param { 
     num_output: 160
     kernel_size: 1
     stride: 1
     pad: 0
  }
}
layer {
  name: "bndata_4d_double_3x3_reduce-cam"
  type: "BNData"
  bottom: "conv_4d_double_3x3_reduce-cam"
  top: "conv_4d_double_3x3_reduce-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4d_double_3x3_reduce-cam"
  type: "ReLU"
  bottom: "conv_4d_double_3x3_reduce-cam"
  top: "conv_4d_double_3x3_reduce-cam"
}
layer {
  name: "conv_4d_double_3x3_0-cam"
  type: "ConvolutionData"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bottom: "conv_4d_double_3x3_reduce-cam"
  top: "conv_4d_double_3x3_0-cam"
  convolution_param { 
     num_output: 96
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "bndata_4d_double_3x3_0-cam"
  type: "BNData"
  bottom: "conv_4d_double_3x3_0-cam"
  top: "conv_4d_double_3x3_0-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    moving_average: true
    decay: 0.05
  }
}
layer {
  name: "relu_4d_double_3x3_0-cam"
  type: "ReLU"
  bottom: "conv_4d_double_3x3_0-cam"
  top: "conv_4d_double_3x3_0-cam"
}
layer {
  name: "conv_4d_double_3x3_1-cam"
  type: "ConvolutionData"
  bottom: "conv_4d_double_3x3_0-cam"
  top: "conv_4d_double_3x3_1-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param { 
     num_output: 96
     kernel_size: 3
     stride: 1
     pad: 1
  }
}
layer {
  name: "bndata_4d_double_3x3_1-cam"
  type: "BNData"
  bottom: "conv_4d_double_3x3_1-cam"
  top: "conv_4d_double_3x3_1-cam"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
